SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0020/MM32L0020_Application/Device/MM32L0020/Include/reg_rcc.h
/***********************************************************************************************************************
    @file     reg_rcc.h
    @author   VV TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
              MM32 FIRMWARE LIBRARY.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/


/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_RCC_H
#define __REG_RCC_H

/* Files includes ------------------------------------------------------------*/
#include <core_cm0plus.h>

#if defined(__CC_ARM)
#pragma anon_unions
#endif

/**
  * @brief RCC Base Address Definition
  */
#define RCC_BASE                        (AHBPERIPH_BASE + 0x1000) /*!< Base Address: 0x40021000 */

/**
  * @brief RCC Register Structure Definition
  */
typedef struct
{
    __IO uint32_t CR;                    /*!< Control Register                               offset: 0x00 */
    __IO uint32_t CFGR;                  /*!< Configuration Register                         offset: 0x04 */
    __IO uint32_t CIR;                   /*!< Clock Interrupt Register                       offset: 0x08 */
    __IO uint32_t RESERVED0x0C;          /*!< RESERVED                                       offset: 0x0C */
    __IO uint32_t APB1RSTR;              /*!< Advanced Peripheral Bus 1 Reset Register       offset: 0x10 */
    __IO uint32_t AHBENR;                /*!< Advanced High Performance Bus Enable Register  offset: 0x14 */
    __IO uint32_t RESERVED0x18;          /*!< Advanced Peripheral Bus 2 Enable Register      offset: 0x18 */
    __IO uint32_t APB1ENR;               /*!< Advanced Peripheral Bus 1 Enable Register      offset: 0x1C */
    __IO uint32_t RESERVED0x24;          /*!< Reserved                                       offset: 0x20 */
    __IO uint32_t CSR;                   /*!< Control Status Register                        offset: 0x24 */
    __IO uint32_t AHBRSTR;               /*!< Advanced High Performance Bus Reset Register   offset: 0x28 */
    __IO uint32_t CFGR2;                 /*!< Configuration Register 2                       offset: 0x2C */
    __IO uint32_t RESERVEDOFFSET0X30[4]; /*!< Reserved                                       offset: 0x30 34 38 3C */
    __IO uint32_t SYSCFGR;               /*!< System Configuration Register                  offset: 0x40 */
    __IO uint32_t RESERVED0x44[3];       /*!< Reserved                                       offset: 0x44 48 4C */
    __IO uint32_t PLLCFGR;               /*!< PLL Configuration Register                     offset: 0x50 */
} RCC_TypeDef;

/**
  * @brief RCC type pointer Definition
  */
#define RCC                             ((RCC_TypeDef *)RCC_BASE)

/**
  * @brief RCC_CR Register Bit Definition
  */
#define RCC_CR_HSION_Pos                (0)
#define RCC_CR_HSION_Msk                (0x01U << RCC_CR_HSION_Pos)         /*!< Internal High Speed clock enable */
#define RCC_CR_HSIRDY_Pos               (1)
#define RCC_CR_HSIRDY_Msk               (0x01U << RCC_CR_HSIRDY_Pos)        /*!< Internal High Speed clock ready flag */
#define RCC_CR_HSIDIV_Pos               (11)
#define RCC_CR_HSIDIV_Msk               (0x07U << RCC_CR_HSIDIV_Pos)
#define RCC_CR_HSIDIV_1                 (0x00U << RCC_CR_HSIDIV_Pos)        /*!< HSI clock division 1   factor  */
#define RCC_CR_HSIDIV_2                 (0x01U << RCC_CR_HSIDIV_Pos)        /*!< HSI clock division 2   factor  */
#define RCC_CR_HSIDIV_4                 (0x02U << RCC_CR_HSIDIV_Pos)        /*!< HSI clock division 4   factor  */
#define RCC_CR_HSIDIV_8                 (0x03U << RCC_CR_HSIDIV_Pos)        /*!< HSI clock division 8   factor  */
#define RCC_CR_HSIDIV_16                (0x04U << RCC_CR_HSIDIV_Pos)        /*!< HSI clock division 16  factor  */
#define RCC_CR_HSIDIV_32                (0x05U << RCC_CR_HSIDIV_Pos)        /*!< HSI clock division 32  factor  */
#define RCC_CR_HSIDIV_64                (0x06U << RCC_CR_HSIDIV_Pos)        /*!< HSI clock division 64  factor  */
#define RCC_CR_HSIDIV_128               (0x07U << RCC_CR_HSIDIV_Pos)        /*!< HSI clock division 128 factor  */
#define RCC_CR_PLLON_Pos                (24)
#define RCC_CR_PLLON_Msk                (0x01U << RCC_CR_PLLON_Pos)         /*!< PLL enable */
#define RCC_CR_PLLRDY_Pos               (25)
#define RCC_CR_PLLRDY_Msk               (0x01U << RCC_CR_PLLRDY_Pos)        /*!< PLL clock ready flag */

/**
  * @brief RCC_CFGR Register Bit Definition
  */
#define RCC_CFGR_SW_Pos                 (0)
#define RCC_CFGR_SW_Msk                 (0x03U << RCC_CFGR_SW_Pos)          /*!< SW[1:0] bits (System clock Switch) */
#define RCC_CFGR_SW_HSI                 (0x00U << RCC_CFGR_SW_Pos)          /*!< HSI selected as system clock */
#define RCC_CFGR_SW_PLL                 (0x02U << RCC_CFGR_SW_Pos)          /*!< PLL selected as system clock */
#define RCC_CFGR_SW_LSI                 (0x03U << RCC_CFGR_SW_Pos)          /*!< LSI selected as system clock */

#define RCC_CFGR_SWS_Pos                (2)
#define RCC_CFGR_SWS_Msk                (0x03U << RCC_CFGR_SWS_Pos)         /*!< SWS[1:0] bits (System Clock Switch Status) */

