SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0020/MM32L0020_Application/Device/MM32L0020/Include/reg_rcc.h
#define RCC_CFGR_HPRE_Pos               (4)
#define RCC_CFGR_HPRE_Msk               (0x0FU << RCC_CFGR_HPRE_Pos)        /*!< HPRE[3:0] bits (AHB prescaler) */
#define RCC_CFGR_PPRE_0                 (0x01U << RCC_CFGR_HPRE_Pos)        /*!< Bit 0 */
#define RCC_CFGR_PPRE_1                 (0x02U << RCC_CFGR_HPRE_Pos)        /*!< Bit 1 */
#define RCC_CFGR_PPRE_2                 (0x04U << RCC_CFGR_HPRE_Pos)        /*!< Bit 2 */
#define RCC_CFGR_PPRE_3                 (0x08U << RCC_CFGR_HPRE_Pos)        /*!< Bit 3 */

#define RCC_CFGR_HPRE_DIV1              (0x00U << RCC_CFGR_HPRE_Pos)        /*!< AHB = FCLK = SYSCLK not divided */
#define RCC_CFGR_HPRE_DIV2              (0x08U << RCC_CFGR_HPRE_Pos)        /*!< AHB = FCLK = SYSCLK divided by 2 */
#define RCC_CFGR_HPRE_DIV4              (0x09U << RCC_CFGR_HPRE_Pos)        /*!< AHB = FCLK = SYSCLK divided by 4 */
#define RCC_CFGR_HPRE_DIV8              (0x0AU << RCC_CFGR_HPRE_Pos)        /*!< AHB = FCLK = SYSCLK divided by 8 */
#define RCC_CFGR_HPRE_DIV16             (0x0BU << RCC_CFGR_HPRE_Pos)        /*!< AHB = FCLK = SYSCLK divided by 16 */
#define RCC_CFGR_HPRE_DIV64             (0x0CU << RCC_CFGR_HPRE_Pos)        /*!< AHB = FCLK = SYSCLK divided by 64 */
#define RCC_CFGR_HPRE_DIV128            (0x0DU << RCC_CFGR_HPRE_Pos)        /*!< AHB = FCLK = SYSCLK divided by 128 */
#define RCC_CFGR_HPRE_DIV256            (0x0EU << RCC_CFGR_HPRE_Pos)        /*!< AHB = FCLK = SYSCLK divided by 256 */
#define RCC_CFGR_HPRE_DIV512            (0x0FU << RCC_CFGR_HPRE_Pos)        /*!< AHB = FCLK = SYSCLK divided by 512 */

#define RCC_CFGR_PPRE1_Pos              (8)
#define RCC_CFGR_PPRE1_Msk              (0x07U << RCC_CFGR_PPRE1_Pos)       /*!< PRE1[2:0] bits (APB1 prescaler) */
#define RCC_CFGR_PPRE1_0                (0x01U << RCC_CFGR_PPRE1_Pos)       /*!< Bit 0 */
#define RCC_CFGR_PPRE1_1                (0x02U << RCC_CFGR_PPRE1_Pos)       /*!< Bit 1 */
#define RCC_CFGR_PPRE1_2                (0x04U << RCC_CFGR_PPRE1_Pos)       /*!< Bit 2 */

#define RCC_CFGR_PPRE1_DIV1             (0x00U << RCC_CFGR_PPRE1_Pos)       /*!< APB1 = HCLK not divided */
#define RCC_CFGR_PPRE1_DIV2             (0x04U << RCC_CFGR_PPRE1_Pos)       /*!< APB1 = HCLK divided by 2 */
#define RCC_CFGR_PPRE1_DIV4             (0x05U << RCC_CFGR_PPRE1_Pos)       /*!< APB1 = HCLK divided by 4 */
#define RCC_CFGR_PPRE1_DIV8             (0x06U << RCC_CFGR_PPRE1_Pos)       /*!< APB1 = HCLK divided by 8 */
#define RCC_CFGR_PPRE1_DIV16            (0x07U << RCC_CFGR_PPRE1_Pos)       /*!< APB1 = HCLK divided by 16 */

#define RCC_CFGR_MCO_Pos                (24)
#define RCC_CFGR_MCO_Msk                (0x0FU << RCC_CFGR_MCO_Pos)         /*!< MCO[2:0] bits (Microcontroller Clock Output) */


/**
  * @brief RCC_CIR Register Bit Definition
  */
#define RCC_CIR_LSIRDYF_Pos             (0)
#define RCC_CIR_LSIRDYF_Msk             (0x01U << RCC_CIR_LSIRDYF_Pos)      /*!< LSI Ready Interrupt flag */

#define RCC_CIR_HSIRDYF_Pos             (2)
#define RCC_CIR_HSIRDYF_Msk             (0x01U << RCC_CIR_HSIRDYF_Pos)      /*!< HSI Ready Interrupt flag */

#define RCC_CIR_PLLRDYF_Pos             (4)
#define RCC_CIR_PLLRDYF_Msk             (0x01U << RCC_CIR_PLLRDYF_Pos)      /*!< PLL Ready Interrupt flag */

#define RCC_CIR_LSIRDYIE_Pos            (8)
#define RCC_CIR_LSIRDYIE_Msk            (0x01U << RCC_CIR_LSIRDYIE_Pos)     /*!< LSI Ready Interrupt Enable */

#define RCC_CIR_HSIRDYIE_Pos            (10)
#define RCC_CIR_HSIRDYIE_Msk            (0x01U << RCC_CIR_HSIRDYIE_Pos)     /*!< HSI Ready Interrupt Enable */

#define RCC_CIR_PLLRDYIE_Pos            (12)
#define RCC_CIR_PLLRDYIE_Msk            (0x01U << RCC_CIR_PLLRDYIE_Pos)     /*!< PLL Ready Interrupt Enable */

#define RCC_CIR_LSIRDYC_Pos             (16)
#define RCC_CIR_LSIRDYC_Msk             (0x01U << RCC_CIR_LSIRDYC_Pos)      /*!< LSI Ready Interrupt Clear */

#define RCC_CIR_HSIRDYC_Pos             (18)
#define RCC_CIR_HSIRDYC_Msk             (0x01U << RCC_CIR_HSIRDYC_Pos)      /*!< HSI Ready Interrupt Clear */

#define RCC_CIR_PLLRDYC_Pos             (20)
#define RCC_CIR_PLLRDYC_Msk             (0x01U << RCC_CIR_PLLRDYC_Pos)      /*!< PLL Ready Interrupt Clear */


/**
  * @brief RCC_APB1RSTR Register Bit Definition
  */
#define RCC_APB1RSTR_TIM3_Pos           (1)
#define RCC_APB1RSTR_TIM3_Msk           (0x01U << RCC_APB1RSTR_TIM3_Pos)        /*!< Timer 3 reset */

#define RCC_APB1RSTR_TIM16_Pos          (4)
#define RCC_APB1RSTR_TIM16_Msk          (0x01U << RCC_APB1RSTR_TIM16_Pos)       /*!< Timer 16 reset */

#define RCC_APB1RSTR_TIM17_Pos          (5)
#define RCC_APB1RSTR_TIM17_Msk          (0x01U << RCC_APB1RSTR_TIM17_Pos)       /*!< Timer 17 reset */

#define RCC_APB1RSTR_ADC_Pos            (9)
#define RCC_APB1RSTR_ADC_Msk            (0x01U << RCC_APB1RSTR_ADC_Pos)         /*!< ADC reset */

#define RCC_APB1RSTR_WWDG_Pos           (11)
#define RCC_APB1RSTR_WWDG_Msk           (0x01U << RCC_APB1RSTR_WWDG_Pos)        /*!< Window Watchdog reset */

#define RCC_APB1RSTR_SPI_Pos            (12)
#define RCC_APB1RSTR_SPI_Msk            (0x01U << RCC_APB1RSTR_SPI_Pos)         /*!< SPI reset */

#define RCC_APB1RSTR_LPTIM_Pos          (14)
#define RCC_APB1RSTR_LPTIM_Msk          (0x01U << RCC_APB1RSTR_LPTIM_Pos)       /*!< LPTIM reset */

#define RCC_APB1RSTR_UART1_Pos          (16)
#define RCC_APB1RSTR_UART1_Msk          (0x01U << RCC_APB1RSTR_UART1_Pos)       /*!< UART 1 reset */

#define RCC_APB1RSTR_LPUART_Pos         (19)
#define RCC_APB1RSTR_LPUART_Msk         (0x01U << RCC_APB1RSTR_LPUART_Pos)      /*!< LPUART rese */


#define RCC_APB1RSTR_I2C_Pos            (21)
#define RCC_APB1RSTR_I2C_Msk            (0x01U << RCC_APB1RSTR_I2C_Pos)         /*!< I2C reset */

#define RCC_APB1RSTR_COMP_Pos           (23)
#define RCC_APB1RSTR_COMP_Msk           (0x01U << RCC_APB1RSTR_COMP_Pos)        /*!< COMP reset */

#define RCC_APB1RSTR_OPA1_Pos           (25)
#define RCC_APB1RSTR_OPA1_Msk           (0x01U << RCC_APB1RSTR_OPA1_Pos)        /*!< OPA 1 reset */

#define RCC_APB1RSTR_OPA2_Pos           (26)
#define RCC_APB1RSTR_OPA2_Msk           (0x01U << RCC_APB1RSTR_OPA2_Pos)        /*!< OPA 2 reset */

#define RCC_APB1RSTR_PWR_Pos            (28)
#define RCC_APB1RSTR_PWR_Msk            (0x01U << RCC_APB1RSTR_PWR_Pos)         /*!< Power interface reset */

#define RCC_APB1RSTR_DBG_Pos            (29)
#define RCC_APB1RSTR_DBG_Msk            (0x01U << RCC_APB1RSTR_DBG_Pos)         /*!< DBG reset */

