SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0020/MM32L0020_Application/Device/MM32L0020/Include/reg_rcc.h
#define RCC_APB1RSTR_SYSCFG_Pos         (30)
#define RCC_APB1RSTR_SYSCFG_Msk         (0x01U << RCC_APB1RSTR_SYSCFG_Pos)      /*!< SYSCFG reset */

/**
  * @brief RCC_AHBENR Register Bit Definition
  */
#define RCC_AHBENR_SRAM_Pos             (2)
#define RCC_AHBENR_SRAM_Msk             (0x01U << RCC_AHBENR_SRAM_Pos)          /*!< SRAM interface clock enable */
#define RCC_AHBENR_FLASH_Pos            (4)
#define RCC_AHBENR_FLASH_Msk            (0x01U << RCC_AHBENR_FLASH_Pos)         /*!< FLASH clock enable */
#define RCC_AHBENR_CRC_Pos              (6)
#define RCC_AHBENR_CRC_Msk              (0x01U << RCC_AHBENR_CRC_Pos)           /*!< CRC clock enable */

#define RCC_AHBENR_GPIOA_Pos            (17)
#define RCC_AHBENR_GPIOA_Msk            (0x01U << RCC_AHBENR_GPIOA_Pos)         /*!< GPIOA clock enable */
#define RCC_AHBENR_GPIOB_Pos            (18)
#define RCC_AHBENR_GPIOB_Msk            (0x01U << RCC_AHBENR_GPIOB_Pos)         /*!< GPIOB clock enable */


/**
  * @brief RCC_APB1ENR Register Bit Definition
  */

#define RCC_APB1ENR_TIM3_Pos            (1)
#define RCC_APB1ENR_TIM3_Msk            (0x01U << RCC_APB1ENR_TIM3_Pos)         /*!< Timer 3 clock enabled */

#define RCC_APB1ENR_TIM16_Pos           (4)
#define RCC_APB1ENR_TIM16_Msk           (0x01U << RCC_APB1ENR_TIM16_Pos)        /*!< Timer 16 clock enabled */
#define RCC_APB1ENR_TIM17_Pos           (5)
#define RCC_APB1ENR_TIM17_Msk           (0x01U << RCC_APB1ENR_TIM17_Pos)       /*!< Timer 17 clock enabled */

#define RCC_APB1ENR_IWDG_Pos            (6)
#define RCC_APB1ENR_IWDG_Msk            (0x01U << RCC_APB1ENR_IWDG_Pos)         /*!< IWDG clock enabled */

#define RCC_APB1ENR_EXTI_Pos            (7)
#define RCC_APB1ENR_EXTI_Msk            (0x01U << RCC_APB1ENR_EXTI_Pos)         /*!< EXTI clock enabled */

#define RCC_APB1ENR_ADC_Pos             (9)
#define RCC_APB1ENR_ADC_Msk             (0x01U << RCC_APB1ENR_ADC_Pos)          /*!< ADC clock enabled */


#define RCC_APB1ENR_WWDG_Pos            (11)
#define RCC_APB1ENR_WWDG_Msk            (0x01U << RCC_APB1ENR_WWDG_Pos)         /*!< Window Watchdog clock enable */
#define RCC_APB1ENR_SPI_Pos             (12)
#define RCC_APB1ENR_SPI_Msk             (0x01U << RCC_APB1ENR_SPI_Pos)          /*!< SPI enable */

#define RCC_APB1ENR_LPTIM_Pos           (14)
#define RCC_APB1ENR_LPTIM_Msk           (0x01U << RCC_APB1ENR_LPTIM_Pos)        /*!< LPTIM clock enable */

#define RCC_APB1ENR_UART1_Pos           (16)
#define RCC_APB1ENR_UART1_Msk           (0x01U << RCC_APB1ENR_UART1_Pos)        /*!< UART 1 clock enable */

#define RCC_APB1ENR_LPUART_Pos          (19)
#define RCC_APB1ENR_LPUART_Msk          (0x01U << RCC_APB1ENR_LPUART_Pos)       /*!< LPUART clock enable */

#define RCC_APB1ENR_I2C_Pos             (21)
#define RCC_APB1ENR_I2C_Msk             (0x01U << RCC_APB1ENR_I2C_Pos)          /*!< I2C clock enable */

#define RCC_APB1ENR_COMP_Pos            (23)
#define RCC_APB1ENR_COMP_Msk            (0x01U << RCC_APB1ENR_COMP_Pos)         /*!< COMP clock enable */

#define RCC_APB1ENR_OPA1_Pos            (25)
#define RCC_APB1ENR_OPA1_Msk            (0x01U << RCC_APB1ENR_OPA1_Pos)         /*!< Operational amplifier1 clock enable */

#define RCC_APB1ENR_OPA2_Pos            (26)
#define RCC_APB1ENR_OPA2_Msk            (0x01U << RCC_APB1ENR_OPA2_Pos)         /*!< Operational amplifier2 clock enable */

#define RCC_APB1ENR_PWR_Pos             (28)
#define RCC_APB1ENR_PWR_Msk             (0x01U << RCC_APB1ENR_PWR_Pos)          /*!< Power interface clock enable */

#define RCC_APB1ENR_DBG_Pos             (29)
#define RCC_APB1ENR_DBG_Msk             (0x01U << RCC_APB1ENR_DBG_Pos)          /*!< DBG clock enable */

#define RCC_APB1ENR_SYSCFG_Pos          (30)
#define RCC_APB1ENR_SYSCFG_Msk          (0x01U << RCC_APB1ENR_SYSCFG_Pos)       /*!< SYSCFG clock enable */


/**
  * @brief RCC_CSR Register Bit Definition
  */
#define RCC_CSR_LSION_Pos               (0)
#define RCC_CSR_LSION_Msk               (0x01U << RCC_CSR_LSION_Pos)            /*!< Internal Low Speed oscillator enable */
#define RCC_CSR_LSIRDY_Pos              (1)
#define RCC_CSR_LSIRDY_Msk              (0x01U << RCC_CSR_LSIRDY_Pos)           /*!< Internal Low Speed oscillator Ready */
#define RCC_CSR_LSIOE_Pos               (5)
#define RCC_CSR_LSIOE_Msk               (0x01U << RCC_CSR_LSIOE_Pos)            /*!< LSI Output Enable */
#define RCC_CSR_PVDRSTEN_Pos            (6)
#define RCC_CSR_PVDRSTEN_Msk            (0x01U << RCC_CSR_PVDRSTEN_Pos)         /*!< PVDRSTEN reset enable */
#define RCC_CSR_LOCKUPEN_Pos            (7)
#define RCC_CSR_LOCKUPEN_Msk            (0x01U << RCC_CSR_LOCKUPEN_Pos)         /*!< CPU Lockup Reset Enable */
#define RCC_CSR_PVDRSTF_Pos             (22)
#define RCC_CSR_PVDRSTF_Msk             (0x01U << RCC_CSR_PVDRSTF_Pos)          /*!< PVD reset flag */
#define RCC_CSR_LOCKUPF_Pos             (23)
#define RCC_CSR_LOCKUPF_Msk             (0x01U << RCC_CSR_LOCKUPF_Pos)          /*!< CPU lockup reset flag */

#define RCC_CSR_RMVF_Pos                (24)
#define RCC_CSR_RMVF_Msk                (0x01U << RCC_CSR_RMVF_Pos)             /*!< Remove reset flag */
#define RCC_CSR_PINRSTF_Pos             (26)
#define RCC_CSR_PINRSTF_Msk             (0x01U << RCC_CSR_PINRSTF_Pos)          /*!< PIN reset flag */

#define RCC_CSR_PORRSTF_Pos             (27)
#define RCC_CSR_PORRSTF_Msk             (0x01U << RCC_CSR_PORRSTF_Pos)          /*!< POR/PDR reset flag */

#define RCC_CSR_SFTRSTF_Pos             (28)
#define RCC_CSR_SFTRSTF_Msk             (0x01U << RCC_CSR_SFTRSTF_Pos)          /*!< Software Reset flag */

#define RCC_CSR_IWDGRSTF_Pos            (29)
#define RCC_CSR_IWDGRSTF_Msk            (0x01U << RCC_CSR_IWDGRSTF_Pos)         /*!< Independent Watchdog reset flag */

#define RCC_CSR_WWDGRSTF_Pos            (30)
#define RCC_CSR_WWDGRSTF_Msk            (0x01U << RCC_CSR_WWDGRSTF_Pos)         /*!< Window watchdog reset flag */
#define RCC_CSR_LPWRRSTF_Pos            (31)
#define RCC_CSR_LPWRRSTF_Msk            (0x01U << RCC_CSR_LPWRRSTF_Pos)         /*!< Low power reset flag */

/**
  * @brief RCC_AHBRSTR Register Bit Definition
  */
#define RCC_AHBRSTR_CRC_Pos             (6)
#define RCC_AHBRSTR_CRC_Msk             (0x01U << RCC_AHBRSTR_CRC_Pos)          /*!< CRC clock reset */
#define RCC_AHBRSTR_GPIOA_Pos           (17)
#define RCC_AHBRSTR_GPIOA_Msk           (0x01U << RCC_AHBRSTR_GPIOA_Pos)        /*!< GPIOA clock reset */
#define RCC_AHBRSTR_GPIOB_Pos           (18)
#define RCC_AHBRSTR_GPIOB_Msk           (0x01U << RCC_AHBRSTR_GPIOB_Pos)        /*!< GPIOB clock reset */

/**
  * @brief RCC_CFGR2 Register Bit Definition
  */
#define RCC_CFGR2_LPUARTCLKSEL_Pos     (0)
#define RCC_CFGR2_LPUARTCLKSEL_Msk     (0x03U << RCC_CFGR2_LPUARTCLKSEL_Pos)      /*!< LPUART clock source selection */
#define RCC_CFGR2_LPUARTCLKSEL_LSE     (0x00U << RCC_CFGR2_LPUARTCLKSEL_Pos)      /*!< LSE (default) */
#define RCC_CFGR2_LPUARTCLKSEL_LSI     (0x01U << RCC_CFGR2_LPUARTCLKSEL_Pos)      /*!< LSI */
#define RCC_CFGR2_LPUARTCLKSEL_PCLK    (0x02U << RCC_CFGR2_LPUARTCLKSEL_Pos)  /*!< PCLK_LPUART */
#define RCC_CFGR2_LPUARTCLKSEL_NONE    (0x03U << RCC_CFGR2_LPUARTCLKSEL_Pos)      /*!< No clock */

#define RCC_CFGR2_MCOPRE_Pos            (20)
#define RCC_CFGR2_MCOPRE_Msk            (0x0FU << RCC_CFGR2_MCOPRE_Pos)
#define RCC_CFGR2_MCOPRE_1              (0x00U << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 1   frequency division */
#define RCC_CFGR2_MCOPRE_2              (0x08U << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 2   frequency division */
#define RCC_CFGR2_MCOPRE_4              (0x09U << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 4   frequency division */
#define RCC_CFGR2_MCOPRE_8              (0x0AU << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 8   frequency division */
#define RCC_CFGR2_MCOPRE_16             (0x0BU << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 16  frequency division */
#define RCC_CFGR2_MCOPRE_64             (0x0CU << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 64  frequency division */
#define RCC_CFGR2_MCOPRE_128            (0x0DU << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 128 frequency division */
#define RCC_CFGR2_MCOPRE_256            (0x0EU << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 256 frequency division */
#define RCC_CFGR2_MCOPRE_512            (0x0FU << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 512 frequency division */

