SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0020/MM32L0020_Application/Device/MM32L0020/Include/reg_rcc.h
#define RCC_CFGR2_LPTIMCLKSEL_Pos      (29)
#define RCC_CFGR2_LPTIMCLKSEL_Msk      (0x03U << RCC_CFGR2_LPTIMCLKSEL_Pos)      /*!< LPTIM clock source selection */
#define RCC_CFGR2_LPTIMCLKSEL_LSE      (0x00U << RCC_CFGR2_LPTIMCLKSEL_Pos)      /*!< LSE (default) */
#define RCC_CFGR2_LPTIMCLKSEL_LSI      (0x01U << RCC_CFGR2_LPTIMCLKSEL_Pos)      /*!< LSI */
#define RCC_CFGR2_LPTIMCLKSEL_PCLK_LPTIMER (0x02U << RCC_CFGR2_LPTIMCLKSEL_Pos)  /*!< PCLK_LPTIMER */
#define RCC_CFGR2_LPTIMCLKSEL_NONE     (0x03U << RCC_CFGR2_LPTIMCLKSEL_Pos)      /*!< No clock */

/**
  * @brief RCC_SYSCFG Register Bit Definition
  */
#define RCC_SYSCFG_PROGCHECKEN_Pos      (0)
#define RCC_SYSCFG_PROGCHECKEN_Msk      (0x01U << RCC_SYSCFG_PROGCHECKEN_Pos) /*!< Whether to check the number in Flash when writing to Flash */


/**
  * @brief RCC_PLLCFGR Register Bit Definition
  */
#define RCC_PLLCFGR_PLLSRC_Pos          (0)
#define RCC_PLLCFGR_PLLSRC_Msk          (0x01U << RCC_PLLCFGR_PLLSRC_Pos)       /*!< HSI as PLL entry clock */
#define RCC_PLLCFGR_PLL_ICTRL_Pos       (2)
#define RCC_PLLCFGR_PLL_ICTRL_Msk       (0x03U << RCC_PLLCFGR_PLL_ICTRL_Pos)    /*!< PLL CP current control signals mask */
#define RCC_PLLCFGR_PLL_ICTRL_0         (0x00U << RCC_PLLCFGR_PLL_ICTRL_Pos)    /*!< PLL CP current control signals 2.5u */
#define RCC_PLLCFGR_PLL_ICTRL_1         (0x01U << RCC_PLLCFGR_PLL_ICTRL_Pos)    /*!< PLL CP current control signals 5u */
#define RCC_PLLCFGR_PLL_ICTRL_2         (0x02U << RCC_PLLCFGR_PLL_ICTRL_Pos)    /*!< PLL CP current control signals 7.5u */
#define RCC_PLLCFGR_PLL_ICTRL_3         (0x03U << RCC_PLLCFGR_PLL_ICTRL_Pos)    /*!< PLL CP current control signals 10u */
#define RCC_PLLCFGR_PLL_ICTRL_2_5       (0x00U << RCC_PLLCFGR_PLL_ICTRL_Pos)    /*!< PLL CP current control signals 2.5u */
#define RCC_PLLCFGR_PLL_ICTRL_5         (0x01U << RCC_PLLCFGR_PLL_ICTRL_Pos)    /*!< PLL CP current control signals 5u */
#define RCC_PLLCFGR_PLL_ICTRL_7_5       (0x02U << RCC_PLLCFGR_PLL_ICTRL_Pos)    /*!< PLL CP current control signals 7.5u */
#define RCC_PLLCFGR_PLL_ICTRL_10        (0x03U << RCC_PLLCFGR_PLL_ICTRL_Pos)    /*!< PLL CP current control signals 10u */
#define RCC_PLLCFGR_PLL_LDS_Pos         (4)
#define RCC_PLLCFGR_PLL_LDS_Msk         (0x03U << RCC_PLLCFGR_PLL_LDS_Pos)      /*!< PLL LOCK DETECTOR ACCURACY SELECT */
#define RCC_PLLCFGR_PLL_LDS_0           (0x00U << RCC_PLLCFGR_PLL_LDS_Pos)      /*!< PLL LOCK DETECTOR ACCURACY value = 0 */
#define RCC_PLLCFGR_PLL_LDS_1           (0x01U << RCC_PLLCFGR_PLL_LDS_Pos)      /*!< PLL LOCK DETECTOR ACCURACY value = 1 */
#define RCC_PLLCFGR_PLL_LDS_2           (0x02U << RCC_PLLCFGR_PLL_LDS_Pos)      /*!< PLL LOCK DETECTOR ACCURACY value = 2 */
#define RCC_PLLCFGR_PLL_LDS_3           (0x03U << RCC_PLLCFGR_PLL_LDS_Pos)      /*!< PLL LOCK DETECTOR ACCURACY value = 3 */
#define RCC_PLLCFGR_PLLDIV_Pos          (8)
#define RCC_PLLCFGR_PLLDIV_Msk          (0x07U << RCC_PLLCFGR_PLLDIV_Pos)       /*!< PLL Divide Factor */
#define RCC_PLLCFGR_PLLMUL_Pos          (16)
#define RCC_PLLCFGR_PLLMUL_Msk          (0xFFU << RCC_PLLCFGR_PLLMUL_Pos)       /*!< PLL Multiplication Factor */
#define RCC_PLLCFGR_PLLPDIV_Pos         (29)
#define RCC_PLLCFGR_PLLPDIV_Msk         (0x07U << RCC_PLLCFGR_PLLPDIV_Pos)      /*!< PLL Pre-divide Factor */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/** --------------------------------------------------------------------------*/
#endif
/** --------------------------------------------------------------------------*/

